## Функция, выполняющая преобразования из шестнадцатеричной записи в десятичную отформатированную.

**Прототип функции:**

```void print(char *out_buf, const char *format, const char *hex_number);```

**Входные данные =**
- 128-битное число со знаком, представленное в двоичном дополнительном коде.
- Число задано в виде шестнадцатеричной строки. Буквы могут быть как верхнего, так и нижнего регистра.
- Если перед числом стоит символ '-', то он трактуется как "инвертировать все биты входного числа и добавить 1".

**Строка формата:**
- Строка формата подобна формату функции sprintf между символами % и i, но необходимо реализовать только небольшое подмножество: флаги '-', '+', ' ', '0' и поле ширины (width). 

**Флаги:**
- `-` – выравнивание по левому краю,
- `+` – всегда выводить знак,
- пробел – вставлять пробел перед положите
льным числом,
- 0 – заполнять незначащие позиции нулями.
- Поле ширины (width).
- Выходной буфер:
- Результат записывается в указанный выходной буфер как нуль-терминированная строка. Строка не содержит лишних символов 

**Конвенция вызова:**
- cdecl

**Пример входных данных**
Входные данные: "-5", "10".
Ожидаемый результат: "16   " (цифры 1 и 6 и три пробела).

```
int x;
sscanf("<hex_number>", "%x", &x);
printf("%<format>i", x);
```